Tekla Open API Reference for Tekla Structures 2025
Color.Transparency Property
 The transparency value of the color, between 0.0 (completely see-through) and 1.0 (completely solid).
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Transparency { get; set; }
Public Property Transparency As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Color Class
Tekla.Structures.Model.UI Namespace